app/controllers/todos_controller.rb

  def create
    title = params[:todo][:title]
    @title = Todo.new(title:title)
    r_json = {}
    begin
      @title.save!
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["title", "abc"], ["created_at", "2024-01-25 05:45:06.490571"], ["updated_at", "2024-01-25 05:45:06.490571"]]

  def update
    @todo = Todo.find(params[:id])
    newTitle = params[:todo][:title]
    r_json = {}
    begin
      @todo.update!(title:newTitle)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "My first task"], ["updated_at", "2024-01-24 07:11:41.678676"], ["id", 1]]

  def delete
    # raise "Sample Error"
    @todo = Todo.find(params[:id])
    @todo.delete
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]